package org.fenixsoft.neonat.ui.view;

/**
 * 页面ASCII模板仓库
 * 
 * @author IcyFenix
 */
public class TempleteRepository {

	/**
	 * 提示符
	 */
	public static final String PROMPT = "\r\nneonat>";

	/**
	 * 欢迎页面
	 */
	public static final String WELCOME_PAGE = "__________________________________________________________________________________\r\n"
			+ " __   _   _____   _____   __   _       ___   _____        _____   _____   _____  \r\n"
			+ "|  \\ | | | ____| /  _  \\ |  \\ | |     /   | |_   _|      |  _  \\ |  _  \\ /  ___/ \r\n"
			+ "|   \\| | | |__   | | | | |   \\| |    / /| |   | |        | |_| | | |_| | | |___  \r\n"
			+ "| |\\   | |  __|  | | | | | |\\   |   / / | |   | |        |  _  { |  _  { \\___  \\ \r\n"
			+ "| | \\  | | |___  | |_| | | | \\  |  / /  | |   | |        | |_| | | |_| |  ___| | \r\n"
			+ "|_|  \\_| |_____| \\_____/ |_|  \\_| /_/   |_|   |_|        |_____/ |_____/ /_____/ \r\n"
			+ "__________________________________________________________________________________\r\n"
			+ "\r\n欢迎来到Neonat BBS，输入help获得BBS命令帮助：";

	/**
	 * 帮助页面
	 */
	public static final String HELP_PAGE = "命令帮助：\r\n"
			+ "----------------------------------------------------------------------------------\r\n"
			+ "  topics：\t\t\t\t显示论坛版面帖子。\r\n"
			+ "  view [帖子ID]：\t\t\t显示指定帖子的详细内容。\r\n"
			+ "  new [标题] [内容]：\t\t\t发表新的帖子。\r\n"
			+ "  reply [帖子ID] [标题] [内容]：\t回复帖子。\r\n"
			+ "  welcome：\t\t\t\t显示欢迎界面。\r\n" + "  help：\t\t\t\t本帮助信息。";

	/**
	 * 论坛版面页面
	 */
	public static final String BOARD_PAGE = "----------------------------------------------------------------------------------\r\n"
			+ "    版面：{0}   贴数：{1}\r\n"
			+ "----------------------------------------------------------------------------------";

	/**
	 * 论坛帖子页面
	 */
	public static final String TOPIC_PAGE = "----------------------------------------------------------------------------------\r\n"
			+ "    帖子：{0}   发帖时间：{1}\r\n"
			+ "----------------------------------------------------------------------------------\r\n"
			+ "    {2}\r\n"
			+ "----------------------------------------------------------------------------------";

	public static void main(String[] args) {
		System.out.println(HELP_PAGE);
	}

}
